app/views/protips/_protip.html.haml

SELECT `protips`.* FROM `protips` ORDER BY created_at DESC
---
%li.protip.clearfix{ :id => "protip_#{protip.id}" }
  .actions.rfloat
    .like{ :class => protip.liked_by_viewer? ? 'liked' : '' }
      .count= protip.likes_count
      .action ♥
  .content
    .text= protip.protip