app/controllers/protips_controller.rb

SELECT `protips`.* FROM `protips` WHERE `protips`.`id` = 3 LIMIT 1
---
  def like
    protip = Protip.find(params[:id])

SELECT `tags`.* FROM `tags` WHERE `tags`.`tag` = 'foo' LIMIT 1
INSERT INTO `tags` (`tag`) VALUES ('foo')
INSERT INTO `protips` (`created_at`, `protip`, `updated_at`, `user_id`) VALUES ('2012-06-11 05:17:17', '', '2012-06-11 05:17:17', 1)
---
  def create
    tags = (params[:protip][:tags] || '').split.map do |tag|
      Tag.find_or_create_by_tag(tag.downcase)
    end
    protip_text = params[:protip][:protip].strip
    if tags.empty? || protip_text.empty?
      redirect_to '/'
      return
    end

    protip = Protip.new :protip => protip_text,
      :user => User.viewer
    protip.tags = tags
    protip.save